/*-------------------------------------------------------------------------------------------------------------
Задача 1. Великденска пекарна
Великденските празници наближават и местната пекарна започва да набавя продуктите, които ще са ѝ нужни за 
изработка на великденските сладкиши. Вашата задача е да напишете програма, която да изчислява нужната сума за 
закупуване на продуктите. Нужните продукти са: брашно, захар, яйца и мая. От конзолата се въвежда цената на 
брашното за килограм, нужните килограми брашно, килограмите захар, броя на корите с яйца и пакетите мая.
•	цената на килограм захар е с 25% по-ниска от тази на килограм брашно
•	цената на една кора с яйца е с 10% по-висока от цената на килограм брашно
•	цената на един пакет мая е с 80% по-ниска от цената на килограм захар
От конзолата се четат 5 реда:
1.	Цена на брашното за един килограм – реално число в интервала [0.00 … 10000.00]
2.	Килограми на брашното – реално число в интервала [0.00 … 10000.00]
3.	Килограми на захарта – реално число в интервала [0.00 … 10000.00]
4.	Брой кори с яйца – цяло число в интервала [0 … 10000]
5.	Пакети мая  – цяло число в интервала [0 … 10000]
---------------------------------------------------------------------------------------------------------------*/
function easterBakery(input){

    let priceFlourKg = Number(input[0]);
    let kgFlour = Number(input[1]);
    let kgSugar = Number(input[2]);
    let eggShells = Number(input[3]);
    let packageMay = Number(input[4]);

    let sugar = 0.75;
    let egg = 1.1;
    let may = 0.2;

    let priceSugarKg = priceFlourKg * sugar;
    let priceEggShells = priceFlourKg * egg;
    let priceMaya = priceSugarKg * may;
    let sumFlour = priceFlourKg * kgFlour;
    let sumSugar = priceSugarKg * kgSugar;
    let sumEgg = priceEggShells * eggShells;
    let sumMay = priceMaya * packageMay;
    let totalSum = (sumFlour + sumSugar + sumEgg + sumMay).toFixed(2);

    console.log(totalSum);

}
easterBakery(["50", "10", "3.5", "6", "1"]); //968.75
easterBakery(["63.44", "3.57", "6.35", "8", "2"]); //1105.92



//ДА